# -*- coding:utf-8 -*-
import os

path_to_tests_pack = "C:" + os.sep + "GVM100_6" + os.sep + "Test" + os.sep

# None - ничего не выбрано программа завершится сразу,
# "First" - только ВМ 0,
# "Second" - только ВМ 1,
# "All" - оба ВМ
target = "All"

# число циклов (< 0 бесконечное выполнение)
value = 1

# "Short", "Long" - вывод ошибок и уведомлений (не реализовано)
type_output = "Long"

# (u"XX)Test...", "hex number test"),
# (u"XX)Test...", "absolute path to file"),
# (u"XX)Test...", (address start, par0, par1, par2, par3)),
# (u"XX)Test...", ("absolute path to file", par0, par1, par2, par3)),
Test_K = (
    (u"1)Тест целостности стартового кода", "00000001"),
    (u"2)Тест процессора", "00000002"),
    (u"3)Тест сопроцессора управления", "00000003"),
    (u"4)Тест ОЗУ", "00000004"),
    (u"5)Тест кэширования памяти", "00000005"),
    (u"6)Тест транслятора виртуальных адресов", "00000006"),
    (u"7)Тест исключительных ситуаций", "00000007"),
    (u"8)Тест сопроцессора правающей точки", "00000008"),
    (u"9)Тест устройства сигналов исправности", "00000009"),
    (u"10)Тест устройства таймеров", "0000000A"),
    (u"11)Тест устройства прерываний", "0000000B"),
    (u"12)Тест канала синхронизации", "0000000C"),
    (u"13)Тест общей памяти (синхронный)", "0000000D"),
    (u"14)Тест контроллеров ввода - вывода", "0000000E"),
    (u"15)Тест идентификации секторов ПЗУ", "0000000F"),
    # (u"16)Тест внешних сигналов", path_to_tests_pack + "TestEsig.run"),
    (u"16)Тест внешних сигналов flash", (0xBFC08000,)),
    # (u"17)Тест сборки МКО", path_to_tests_pack + "TestBu.run"),
    (u"17)Тест сборки МКО flash", (0xBFC08008,)),
    # (u"18)Тест последовательного канала RS-485", path_to_tests_pack + "Test485.run"),
    (u"18)Тест последовательного канала RS-485 flash", (0xBFC08010,)),
    # (u"19)Тест энергопотребления", path_to_tests_pack + "TestEnrg.run"),
    (u"19)Тест энергопотребления flash", (0xBFC08018,)),
    # (u"20)Тест ПЗУ расширенный flash", path_to_tests_pack + "AM29LV800DB.run"),
    (u"20)Тест ПЗУ расширенный flash", (0xBFC08020,)),
)

# 9600, 14400, 19200, 38400, 57600, 115200 - список доступных скоростей
required_baud_rate = 57600  # 19200

# "Ignore" - игнорировать учет ошибок,
# "FirstError" - завершение по первой ошибке,
# "LimitError" - завершение по определенному кол-ву ошибок, заданному в value_error
error_control = "Ignore"
value_error = 0
